In [1]:
import pandas as pd

In [2]:
data = {
    "a":[1,2,3,4],
    "b":[4,5,6,7],
    "c":["faisal","krish","hitesth","navin"]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   a  b        c
0  1  4   faisal
1  2  5    krish
2  3  6  hitesth
3  4  7    navin

In [6]:
df.set_index('a')

   b        c
a
1  4   faisal
2  5    krish
3  6  hitesth
4  7    navin

In [7]:
df.set_index('a',inplace=True)

In [8]:
df

   b        c
a
1  4   faisal
2  5    krish
3  6  hitesth
4  7    navin

In [9]:
df.reset_index()

   a  b        c
0  1  4   faisal
1  2  5    krish
2  3  6  hitesth
3  4  7    navin

In [10]:
df.reset_index(inplace=True)

In [13]:
data = {
    "a":[1,2,3,4],
    "b":[4,5,6,7],
    "c":["faisal","krish","hitesth","navin"]
}
df1 = pd.DataFrame(data,index=['a','b','c','d']) # by default indexes will be as a b c..

In [14]:
# lets do re indexing

In [15]:
df1.reindex(['b','c','d','a'])

   a  b        c
b  2  5    krish
c  3  6  hitesth
d  4  7    navin
a  1  4   faisal

In [16]:
df1

   a  b        c
a  1  4   faisal
b  2  5    krish
c  3  6  hitesth
d  4  7    navin

In [18]:
# df1.reindex(['b','c','d','a'],True)

In [20]:
df1.iterrows() # genrator function

In [21]:
for i in df1.iterrows():
    print(i)

('a', a         1
b         4
c    faisal
Name: a, dtype: object)
('b', a        2
b        5
c    krish
Name: b, dtype: object)
('c', a          3
b          6
c    hitesth
Name: c, dtype: object)
('d', a        4
b        7
c    navin
Name: d, dtype: object)

In [22]:
df1

   a  b        c
a  1  4   faisal
b  2  5    krish
c  3  6  hitesth
d  4  7    navin

In [24]:
for i,j in df1.iterrows():
    print(j)

a         1
b         4
c    faisal
Name: a, dtype: object
a        2
b        5
c    krish
Name: b, dtype: object
a          3
b          6
c    hitesth
Name: c, dtype: object
a        4
b        7
c    navin
Name: d, dtype: object

In [27]:
# for i,j in df1.iteritems(): # iteritems is depracated
for i, j in df1.items():
    print(i, j)

a a    1
b    2
c    3
d    4
Name: a, dtype: int64
b a    4
b    5
c    6
d    7
Name: b, dtype: int64
c a     faisal
b      krish
c    hitesth
d      navin
Name: c, dtype: object

In [28]:
for col_name,column in df1.items():
    print(col_name,column)

a a    1
b    2
c    3
d    4
Name: a, dtype: int64
b a    4
b    5
c    6
d    7
Name: b, dtype: int64
c a     faisal
b      krish
c    hitesth
d      navin
Name: c, dtype: object

In [30]:
[i for i in df['a']] # gives you list present in

[1, 2, 3, 4]

In [33]:
list(df['a']) # here is shrot way

[1, 2, 3, 4]

In [34]:
def test(x):
    return x.sum()
df1.apply(test)

a                         10
b                         22
c    faisalkrishhitesthnavin
dtype: object

In [37]:
# df.apply(test,axis=1) #error

In [38]:
df2 = df1[['a','b']]

In [39]:
df2

   a  b
a  1  4
b  2  5
c  3  6
d  4  7

In [42]:
# apply functionis used for oone column
# df2.applymap(lambda x: x**2) 
# applymap is deprecated
df2.map(lambda x : x **2)

    a   b
a   1  16
b   4  25
c   9  36
d  16  49

In [43]:
df1

   a  b        c
a  1  4   faisal
b  2  5    krish
c  3  6  hitesth
d  4  7    navin

In [44]:
# sorting

In [45]:
df

   a  b        c
0  1  4   faisal
1  2  5    krish
2  3  6  hitesth
3  4  7    navin

In [46]:
# lets sort c column
df.sort_values('c')

   a  b        c
0  1  4   faisal
2  3  6  hitesth
1  2  5    krish
3  4  7    navin

In [49]:
# df.sort_values('c',ascending=False)

In [50]:
df

   a  b        c
0  1  4   faisal
1  2  5    krish
2  3  6  hitesth
3  4  7    navin

In [52]:
df.sort_index(ascending=False)

   a  b        c
3  4  7    navin
2  3  6  hitesth
1  2  5    krish
0  1  4   faisal

In [57]:
# we are working with text 
pd.DataFrame({
    "Desc":["a very big description fksdkljfklsdj flsjlfkjsdklfjsklf klsdjfklsdjklfjsdkl fskldfklsdjfkljsdklfjskldfjlskdjfkl sdklfjskld flsjdklfjsdklfjklsdjflkweoiwerioufjslkjfklwueioruiojkljlkjkjkl "]
})

                                                Desc
0  a very big description fksdkljfklsdj flsjlfkjs...

In [62]:
pd.set_option('display.max_colwidth',500)
df3 = pd.DataFrame({
    "Desc":["a very big description fksdkljfklsdj flsjlfkjsdklfjsklf klsdjfklsdjklfjsdkl fskldfklsdjfkljsdklfjskldfjlskdjfkl sdklfjskld flsjdklfjsdklfjklsdjflkweoiwerioufjslkjfklwueioruiojkljlkjkjkl ",
    "my name is faisal","i am ds master"
    ]
})

In [63]:
df3

                                                                                                                                                                                         Desc
0  a very big description fksdkljfklsdj flsjlfkjsdklfjsklf klsdjfklsdjklfjsdkl fskldfklsdjfkljsdklfjskldfjlskdjfkl sdklfjskld flsjdklfjsdklfjklsdjflkweoiwerioufjslkjfklwueioruiojkljlkjkjkl
1                                                                                                                                                                           my name is faisal
2                                                                                                                                                                              i am ds master

In [66]:
df3['len'] = df3['Desc'].apply(len)

In [67]:
df3

,Desc,len
0,a very big description fksdkljfklsdj flsjlfkjsdklfjsklf klsdjfklsdjklfjsdkl fskldfklsdjfkljsdklfjskldfjlskdjfkl sdklfjskld flsjdklfjsdklfjklsdjflkweoiwerioufjslkjfklwueioruiojkljlkjkjkl,186
1,my name is faisal,17
2,i am ds master,14

In [72]:
t = 'i am ds master'
# t.split()  # seperated by default into list of strings
# len(t.split())

In [74]:
t = []
df['word_count'] =  df['Desc'].apply(lambda x : len(x.split()))

KeyError: 'Desc'